Revit 2027 API
ParameterTypeId.DecalLockProportions Property
 "Lock Proportions"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId DecalLockProportions { get; }
Public Shared ReadOnly Property DecalLockProportions As ForgeTypeId
	Get
public:
static property ForgeTypeId^ DecalLockProportions {
	ForgeTypeId^ get ();
}
static member DecalLockProportions : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace